src/app/Models/CongeModel.php

SELECT `conges`.*, `types_conge`.`libelle`
FROM `conges`
JOIN `types_conge` ON `types_conge`.`id` = `conges`.`type_conge_id`
WHERE `conges`.`employe_id` = 2
ORDER BY `conges`.`created_at` DESC
---
    public function getDemandesEmploye(int $employeId): array
    {
        return $this->select('conges.*, types_conge.libelle')
            ->join('types_conge', 'types_conge.id = conges.type_conge_id')
            ->where('conges.employe_id', $employeId)
            ->orderBy('conges.created_at', 'DESC')
            ->findAll();

SELECT `conges`.*, `employes`.`nom`, `employes`.`prenom`, `employes`.`departement_id`, `types_conge`.`libelle` as `type_libelle`
FROM `conges`
JOIN `employes` ON `employes`.`id` = `conges`.`employe_id`
JOIN `types_conge` ON `types_conge`.`id` = `conges`.`type_conge_id`
WHERE `conges`.`statut` = 'en_attente'
ORDER BY `conges`.`created_at` ASC
---
    public function getDemandesEnAttente(): array
    {
        return $this->select('conges.*, employes.nom, employes.prenom, employes.departement_id,
                              types_conge.libelle as type_libelle')
            ->join('employes', 'employes.id = conges.employe_id')
            ->join('types_conge', 'types_conge.id = conges.type_conge_id')
            ->where('conges.statut', 'en_attente')
            ->orderBy('conges.created_at', 'ASC')
            ->findAll();

SELECT `conges`.*, `employes`.`nom`, `employes`.`prenom`, `employes`.`departement_id`, `types_conge`.`libelle` as `type_libelle`, `departements`.`nom` as `departement_nom`, `traite`.`nom` as `traite_nom`, `traite`.`prenom` as `traite_prenom`
FROM `conges`
JOIN `employes` ON `employes`.`id` = `conges`.`employe_id`
JOIN `types_conge` ON `types_conge`.`id` = `conges`.`type_conge_id`
LEFT JOIN `departements` ON `departements`.`id` = `employes`.`departement_id`
LEFT JOIN `employes` as `traite` ON `traite`.`id` = `conges`.`traite_par`
ORDER BY `conges`.`created_at` DESC
---
    public function getDemandesFiltrees(?string $statut = null, ?int $departementId = null): array
    {
        $this->select('conges.*, employes.nom, employes.prenom, employes.departement_id,
                       types_conge.libelle as type_libelle')
            ->join('employes', 'employes.id = conges.employe_id')
            ->join('types_conge', 'types_conge.id = conges.type_conge_id');

        if ($statut) {
            $this->where('conges.statut', $statut);
        }

        if ($departementId) {
            $this->where('employes.departement_id', $departementId);
        }

        return $this->orderBy('conges.created_at', 'DESC')->findAll();

SELECT `conges`.*, `employes`.`nom`, `employes`.`prenom`, `employes`.`departement_id`, `types_conge`.`libelle` as `type_libelle`
FROM `conges`
JOIN `employes` ON `employes`.`id` = `conges`.`employe_id`
JOIN `types_conge` ON `types_conge`.`id` = `conges`.`type_conge_id`
WHERE `conges`.`statut` = 'approuvee'
AND MONTH(conges.date_debut) = 5
AND YEAR(conges.date_debut) = 2026
ORDER BY `conges`.`date_debut` ASC
---
    public function getAbsencesMois(int $mois, int $annee): array
    {
        return $this->select('conges.*, employes.nom, employes.prenom, employes.departement_id,
                              types_conge.libelle as type_libelle')
            ->join('employes', 'employes.id = conges.employe_id')
            ->join('types_conge', 'types_conge.id = conges.type_conge_id')
            ->where('conges.statut', 'approuvee')
            ->where('MONTH(conges.date_debut)', $mois)
            ->where('YEAR(conges.date_debut)', $annee)
            ->orderBy('conges.date_debut', 'ASC')
            ->findAll();

SELECT `conges`.*, `emp1`.`nom` as `employe_nom`, `emp1`.`prenom` as `employe_prenom`, `emp2`.`nom` as `traite_nom`, `emp2`.`prenom` as `traite_prenom`, `types_conge`.`libelle` as `type_libelle`, `departements`.`nom` as `departement_nom`
FROM `conges`
JOIN `employes` as `emp1` ON `emp1`.`id` = `conges`.`employe_id`
LEFT JOIN `employes` as `emp2` ON `emp2`.`id` = `conges`.`traite_par`
JOIN `types_conge` ON `types_conge`.`id` = `conges`.`type_conge_id`
LEFT JOIN `departements` ON `departements`.`id` = `emp1`.`departement_id`
ORDER BY `conges`.`created_at` DESC
---
    public function getHistoriqueComplet(): array
    {
        return $this->select('conges.*, emp1.nom as employe_nom, emp1.prenom as employe_prenom,
                              emp2.nom as traite_nom, emp2.prenom as traite_prenom,
                              types_conge.libelle as type_libelle,
                              departements.nom as departement_nom')
            ->join('employes as emp1', 'emp1.id = conges.employe_id')
            ->join('employes as emp2', 'emp2.id = conges.traite_par', 'left')
            ->join('types_conge', 'types_conge.id = conges.type_conge_id')
            ->join('departements', 'departements.id = emp1.departement_id', 'left')
            ->orderBy('conges.created_at', 'DESC')
            ->findAll();