src/app/Models/SoldeModel.php

SELECT `soldes`.*, `types_conge`.`libelle`, `types_conge`.`jours_annuels`, `types_conge`.`deductible`, (soldes.jours_attribues - soldes.jours_pris) as reste
FROM `soldes`
JOIN `types_conge` ON `types_conge`.`id` = `soldes`.`type_conge_id`
WHERE `soldes`.`employe_id` = 4
ORDER BY `soldes`.`annee` DESC
---
    public function getSoldesEmploye(int $employeId): array
    {
        return $this->select('soldes.*, types_conge.libelle, types_conge.jours_annuels, types_conge.deductible,
                              (soldes.jours_attribues - soldes.jours_pris) as reste')
            ->join('types_conge', 'types_conge.id = soldes.type_conge_id')
            ->where('soldes.employe_id', $employeId)
            ->orderBy('soldes.annee', 'DESC')
            ->findAll();