src/app/Controllers/Admin.php

    public function index()
    {
        if ($redirect = $this->requireRole('admin')) return $redirect;

        $congeModel       = new CongeModel();
        $employeModel     = new EmployeModel();
        $departementModel = new DepartementModel();

        $mois     = date('n');
        $annee    = date('Y');
        $absences = $congeModel->getAbsencesMois($mois, $annee);

        return view('admin/dashboard', $this->viewData([
            'absences'        => $absences,
            'nb_employes'     => $employeModel->countAll(),
            'nb_departements' => $departementModel->countAll(),
---
SELECT COUNT(*) AS `numrows` FROM `employes`
SELECT COUNT(*) AS `numrows` FROM `departements`

    public function departements()
    {
        if ($redirect = $this->requireRole('admin')) return $redirect;

        $departementModel = new DepartementModel();
        $employeModel     = new EmployeModel();
        $departements     = $departementModel->findAll();

        $nbEmployes = [];
        foreach ($departements as $d) {
            $nbEmployes[$d['id']] = $employeModel->where('departement_id', $d['id'])->countAllResults();
---
SELECT *
FROM `departements`
SELECT COUNT(*) AS `numrows`
FROM `employes`
WHERE `departement_id` = '1'

    public function demandes()
    {
        if ($redirect = $this->requireRole('admin')) return $redirect;

        $congeModel       = new CongeModel();
        $departementModel = new DepartementModel();

        $statut        = $this->request->getGet('statut');
        $departementId = $this->request->getGet('departement_id');

        $demandes = $congeModel->getDemandesFiltrees(
            $statut ?: null,
            $departementId ? (int) $departementId : null
        );

        return view('admin/demandes/index', $this->viewData([
            'demandes'           => $demandes,
            'departements'       => $departementModel->findAll(),
---
SELECT *
FROM `departements`

    public function soldes()
    {
        if ($redirect = $this->requireRole('admin')) return $redirect;

        $soldeModel = new SoldeModel();
        $annee      = $this->request->getGet('annee') ? (int) $this->request->getGet('annee') : (int) date('Y');

        $soldes = $soldeModel
            ->select('soldes.*, employes.nom, employes.prenom, types_conge.libelle,
                      (soldes.jours_attribues - soldes.jours_pris) as reste')
            ->join('employes', 'employes.id = soldes.employe_id')
            ->join('types_conge', 'types_conge.id = soldes.type_conge_id')
            ->where('soldes.annee', $annee)
            ->orderBy('employes.nom', 'ASC')
            ->findAll();
---
SELECT `soldes`.*, `employes`.`nom`, `employes`.`prenom`, `types_conge`.`libelle`, (soldes.jours_attribues - soldes.jours_pris) as reste
FROM `soldes`
JOIN `employes` ON `employes`.`id` = `soldes`.`employe_id`
JOIN `types_conge` ON `types_conge`.`id` = `soldes`.`type_conge_id`
WHERE `soldes`.`annee` = 2026
ORDER BY `employes`.`nom` ASC