src/app/Controllers/Auth.php

    public function login()
    {
        $email    = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $model  = new EmployeModel();
        $employe = $model->where('email', $email)->first();
---
SELECT *
FROM `employes`
WHERE `email` = 'teoandriamonta@gmail.com'
 LIMIT 1