src/app/Controllers/Employe.php

SELECT `employes`.*, `departements`.`nom` as `departement_nom`
FROM `employes`
LEFT JOIN `departements` ON `departements`.`id` = `employes`.`departement_id`
WHERE `employes`.`id` = 4
---
    public function profil()
    {
        if ($redirect = $this->requireRole('employe')) return $redirect;

        $employeModel     = new EmployeModel();
        $departementModel = new DepartementModel();
        $employe          = $employeModel
            ->select('employes.*, departements.nom as departement_nom')
            ->join('departements', 'departements.id = employes.departement_id', 'left')
            ->find($this->employe['id']);